# Лабораторна робота №1. Основи Python
# Варіант: 2
# ПІБ: Зеленько Ярослав Олександрович


#Тут має бути Ваш код
print("Конвертер валют Відьмака")
print("1 орен = 2.5 крони")
print("1 орен = 1.8 флорена")

#Користувач вводить кількість оренів
oren = input("Введіть кількість оренів:")

#Перевірка, чи правильно введено число
try:
    oren = float(oren)

    if oren < 0:
        print ("Помилка, число не може бути від'эмним.")
    else:
        #Рахую крони та флорени
        krona = oren * 2.5
        floren = oren * 1.8
        
        #Результат
        print("Кількість кронн:", krona)
        print("Кількість флоренів:", floren)
    
except ValueError:
        print("Помилка, потрібно ввести число.")



# Не забувайте форматувати вивід та додавати коментарі!
